from aiogram.types import Message
from aiogram import Router
from aiogram.filters import CommandStart
from aiogram.types import FSInputFile
from keyboards.start import start_keyboard

router = Router()

@router.message(CommandStart())
async def cmd_start(message: Message):
    photo = FSInputFile("IT_PHOTO.png")

    await message.answer_photo(
        photo=photo,
        caption=
        "👋 Добро пожаловать в IT-бот\n\n"
        "🚀 Здесь ты сделаешь первые шаги в мире информационных технологий.\n\n"
        "📌 Этот бот поможет тебе:\n"
        "• понять, что такое IT и какие направления существуют\n"
        "• определить, подходит ли тебе профессия программиста\n"
        "• выбрать своё направление и выстроить путь обучения\n"
        "• получить полезные советы для старта без хаоса и лишней воды\n\n"
        "⚠️ В IT выживают не все. Здесь нужны дисциплина, мышление и постоянная работа над собой.\n\n"
        "👇 Нажимай кнопки ниже и начинай свой путь осознанно.",
        reply_markup=start_keyboard
    )
